#!/usr/bin/env python
# -*- coding: utf-8 -*-
#####
import PySimpleGUI as sg
# import pyautogui as pg

# *====================================================================================
# * GUI作成
# *====================================================================================
# +-----------------------------------------------------------------------------------+
# + スタイル設定
# +-----------------------------------------------------------------------------------+
sg.theme('Dark Blue 3')

# +-----------------------------------------------------------------------------------+
# + レイアウト設定
# +-----------------------------------------------------------------------------------+
layout = [
			[sg.Text("Fine", size=(5,1)),
			sg.Slider(range=(1.0,9.99),
					  default_value = 1.0,
					  resolution=0.01,
					  orientation='h',
					  size=(100, 10),
					  enable_events=True,
					  key='slider1')],
			[sg.Text("Rough", size=(5,1)),
				sg.Slider(range=(-50,50),
					  default_value =0,
					  resolution=1,
					  orientation='h',
					  size=(100, 10),
					  enable_events=True,
					  key='slider2')],
			
			[ sg.InputText(1.0, size=(4,1), key='input1'), 
			sg.Text("E", size=(1,1)),
			sg.InputText(0.0, size=(10,1), key='input2')],

		#    [ sg.Submit(button_text='確定',
		# 			   font=('yu Gothic UI',8),size=(15,2),pad=((216,0),(0,0)),key='button1'),],
	]

# +-----------------------------------------------------------------------------------+
# + ウィンドウ作成
# +-----------------------------------------------------------------------------------+
window = sg.Window('Slider', layout)

# *====================================================================================
# * プログラム開始
# *====================================================================================
# +-----------------------------------------------------------------------------------+
# + GUIループ
# +-----------------------------------------------------------------------------------+
while True:
	# ウィンドウ表示
	event, values = window.read()

	# ウィンドウを閉じたときの処理
	if event in [sg.WIN_CLOSED, '-cancel-']:
		break

	if event == "slider1" or event == "slider2":
		val1 = float(values['slider1'])*10**float(values['slider2'])
		text = f'{val1:.2e}'
		window['input1']. Update(text)

	# if event == "button1":
	# 	window['slider1']. Update(int(values['input1']))
	
window.close()

